     public class main1 {
        public static void main(String[] args) {
            boolean registered = true;
            int a = 5000;
            float amount = 20;
            float bonus = a / amount;
            System.out.println(bonus);

            // Объявляете переменные для входных данных и
            // параметров программы: одну для хранения
            // стоимости билета, другую для хранения количества
            // рублей для одной бонусной милли

            // Рассчитываете количество бонусных милль, используя
            // значения заведённых переменных. Ответ сохраняете в
            // новую переменную и выводите на экран
        }
    }

